---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurtainSystemType
source: html/56ca3c28-8e8d-a774-2f5b-ddf4d2558865.htm
---
# CurtainSystemType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.